# TBB_GetPageArea

## Description
Gets the page area of the selected layer in inches

```pascal
PROCEDURE TBB_GetPageArea(
				LayerHand      : HANDLE;
				VAR PageWidth  : REAL;
				VAR PageHeight : REAL);
```

```python

def vs.TBB_GetPageArea(LayerHand):
    return (PageWidth, PageHeight)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|LayerHand|HANDLE||
|PageWidth|REAL||
|PageHeight|REAL||

## Version
Availability: from Vectorworks 2019.1
## Category
* Utility